{"attributes":{"columns":[],"description":"This broken search is a prime example of how metadata from data sources is not included by default.","grid":{},"hideChart":false,"isTextBasedQuery":true,"kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"esql\":\"FROM logs-kibana-ctf\\n| WHERE process.name == \\\"yams.exe\\\"\\n| EVAL id_decode = FROM_BASE64(_id)\\n| LIMIT 10\"},\"index\":{\"id\":\"60e3c19154abeae1869efe56b794835de07678e6fbb31a03a2e3ae73db9c29e2\",\"title\":\"logs-kibana-ctf\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-kibana-ctf\",\"allowHidden\":false},\"filter\":[]}"},"sort":[],"timeRestore":false,"title":"ES|QL - Metadata","visContext":{}},"coreMigrationVersion":"8.8.0","created_at":"2025-02-17T23:00:10.920Z","id":"metadata-again-id","managed":false,"references":[],"type":"search","typeMigrationVersion":"10.5.0","updated_at":"2025-02-19T03:18:39.735Z","updated_by":"u_hSeY4x75rHYs6UkRYEMwXq0BbaHhEaxeNrNVNtL632w_0","version":"WzE4MiwyXQ=="}
{"excludedObjects":[],"excludedObjectsCount":0,"exportedCount":1,"missingRefCount":0,"missingReferences":[]}