{"attributes":{"columns":[],"description":"Fork and fork and fork and fork!","grid":{"columns":{"url.full":{"width":282}}},"hideChart":true,"isTextBasedQuery":true,"kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"esql\":\"FROM logs-kibana-ctf\\r\\n| FORK ( WHERE event.category == \\\"process\\\" AND process.name : \\\"chrome.exe\\\") ( WHERE event.category == \\\"network\\\" AND url.domain == \\\"phishy.site\\\" ) ( WHERE event.category == \\\"process\\\" AND process.name == \\\"powershell.exe\\\") ( WHERE event.category == \\\"network\\\" AND url.domain == \\\"malicious.site\\\" ) ( WHERE event.category == \\\"process\\\" AND process.name == \\\"notepad.exe\\\" )\\r\\n//| KEEP _fork, user.name, event.category, source.ip, process.name, url.full, event.action, message\"},\"index\":{\"id\":\"60e3c19154abeae1869efe56b794835de07678e6fbb31a03a2e3ae73db9c29e2\",\"title\":\"logs-kibana-ctf\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-kibana-ctf\",\"allowHidden\":false},\"filter\":[]}"},"sort":[],"timeRestore":false,"title":"ES|QL - What the Fork?","usesAdHocDataView":true,"visContext":{}},"coreMigrationVersion":"8.8.0","created_at":"2025-09-04T16:27:32.344Z","created_by":"u_mGBROF_q5bmFCATbLXAcCwKa0k8JvONAwSruelyKA5E_0","id":"fork-id","managed":false,"references":[],"type":"search","typeMigrationVersion":"10.5.0","updated_at":"2025-09-04T21:27:58.215Z","updated_by":"u_mGBROF_q5bmFCATbLXAcCwKa0k8JvONAwSruelyKA5E_0","version":"WzMzMywxXQ=="}
{"excludedObjects":[],"excludedObjectsCount":0,"exportedCount":1,"missingRefCount":0,"missingReferences":[]}