{"attributes":{"columns":["@timestamp","message","process.command_line","process.command_line.text","process.name","process.name.text"],"description":"Use a regex to find the flag in the logs!","grid":{},"hideChart":false,"isTextBasedQuery":true,"kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"esql\":\"FROM logs-kibana-ctf\\n| WHERE message =~ \\\\(c(t(c|t|f)|t|f)f(_(r(e(g(e|x)|g)|e)|r)|r)egex(_(f(o(r|r)|o)|f)|f)or(_(t(h(e|e)|h)|t)|t)he(_(w(i(n|n)|i)|w)|w)in)\\\\\\n| KEEP @timestamp, message//, process.*\\n| LIMIT 10\"},\"index\":{\"id\":\"d6c911aa50e2dafcebcedfa50190d5c03bbac0070c96d6b16feb18aa1f84b5da\",\"title\":\"logs-*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-*\",\"allowHidden\":false},\"filter\":[]}"},"sort":[["@timestamp","desc"]],"timeRestore":false,"title":"ES|QL - Regex Rumble","usesAdHocDataView":true,"visContext":{}},"coreMigrationVersion":"8.8.0","created_at":"2025-08-31T17:40:32.224Z","created_by":"u_mGBROF_q5bmFCATbLXAcCwKa0k8JvONAwSruelyKA5E_0","id":"regex-rumble-id","managed":false,"references":[],"type":"search","typeMigrationVersion":"10.5.0","updated_at":"2025-08-31T17:55:24.344Z","updated_by":"u_mGBROF_q5bmFCATbLXAcCwKa0k8JvONAwSruelyKA5E_0","version":"WzM2LDJd"}
{"excludedObjects":[],"excludedObjectsCount":0,"exportedCount":1,"missingRefCount":0,"missingReferences":[]}